#!/bin/bash

# echocolor_test.sh，显示echo -e 各颜色代码对比

# 控制字符代码：
# 0：关闭颜色属性命令，恢复为黑白色；
# 1：加粗显示文本字符；
# 4：为文本字符加下划线标识；
# 5：使文本字符闪烁；
# 7：将文本字符的背景色和前景色交换显示；
# 8：将文本字符的背景色和前景色设置为相同颜色；
  
# 30-39：设置文本字符的前景色，38,39为保留，未被使用；
# 40-49：设置文本字符的背景色，48,49为保留，暂时未被使用；
echo -e "\n========================================================================================="
echo -e "在Bash下输出彩色的文本 \n"
echo -e "\e[1;41m格式：\\\e[控制代码;彩色文字代码 \e[0m\n"
echo "\e 或者\033：Ctrl键 "
echo "[：控制字符和颜色代码之间的间隔字符 "
echo "所有的颜色代码都应该使用m结尾： "

echo -e "\n========================================================================================="

echo -e "控制字符代码："
echo -e "0：关闭颜色属性命令                        \e[0;33m 0：关闭颜色属性命令 \e[0m"
echo -e "1：加粗显示文本字符                        \e[1;33m 1：加粗显示文本字符 \e[0m"
#echo -e "2：示文本字符                              \e[2;33m 2：示文本字符 \e[0m"
echo -e "3：倾斜显示文本字符                        \e[3;33m 3：倾斜显示文本字符 \e[0m"
echo -e "4：为文本字符加下划线标识                  \e[4;33m 4：为文本字符加下划线标识 \e[0m"
echo -e "5：使文本字符闪烁                          \e[5;33m 5：使文本字符闪烁 \e[0m"
#echo -e "6：示文本字符                             \e[2;33m 6：示文本字符 \e[0m"
echo -e "7：将文本字符的背景色和前景色交换显示       \e[7;33m 7：将文本字符的背景色和前景色交换显示 \e[0m"
echo -e "8：将文本字符的背景色和前景色设置为相同颜色 \e[8;33m 8：将文本字符的背景色和前景色设置为相同颜色 \e[0m"

echo -e "\n========================================================================================="

#注意：此类控制字符和颜色代码必须放置在echo -e中显示
#echo -e "\033[1;35mhello\033[0m"

# 彩色文字：黑红绿黄30-33  蓝洋青白34-37
# 彩色背景：黑红绿黄40-43  蓝洋青白44-47

# 重置=0   \e[0m        resetColor="\e[0m"
# 黑色=30  \e[1;30m     blackColor="\e[1;30m"
# 红色=31  \e[1;31m     redColor="\e[1;31m " 
# 绿色=32  \e[1;32m     greenColor="\e[1;32m"
# 黄色=33  \e[1;33m     yellowColor="\e[1;33m"
# 蓝色=34  \e[1;34m     blueColor="\e[1;34m"
# 洋红=35  \e[1;35m     magentaColor="\e[1;35m"
# 青色=36  \e[1;36m     cyanColor="\e[1;36m"
# 白色=37  \e[1;37m     whiteColor="\e[1;37m"

echo -e "彩色文字代码：重置=0 黑色=30 红色=31 绿色=32 黄色=33 蓝色=34 洋红=35 青色=36 白色=37"
echo -e "彩色背景代码：重置=0 黑色=40 红色=41 绿色=42 黄色=43 蓝色=44 洋红=45 青色=46 白色=47"
echo -e "黑红绿黄30-33  蓝洋青白34-37"
echo -e "黑红绿黄40-43  蓝洋青白44-47"
echo -e "-----------------------------------------------------------------------------------------"
echo -e "黑色文字=30 \e[1;30m 黑色文字=30 \e[0m"  "    ########    "  "黑色背景=40 \e[1;40m 黑色背景=40 \e[0m\n"
echo -e "红色文字=31 \e[1;31m 红色文字=31 \e[0m"  "    ########    "  "红色背景=41 \e[1;41m 红色背景=41 \e[0m\n"
echo -e "绿色文字=32 \e[1;32m 绿色文字=32 \e[0m"  "    ########    "  "绿色背景=42 \e[1;42m 绿色背景=42 \e[0m\n"
echo -e "黄色文字=33 \e[1;33m 黄色文字=33 \e[0m"  "    ########    "  "黄色背景=43 \e[1;43m 黄色背景=43 \e[0m\n"
echo -e "蓝色文字=34 \e[1;34m 蓝色文字=34 \e[0m"  "    ########    "  "蓝色背景=44 \e[1;44m 蓝色背景=44 \e[0m\n"
echo -e "洋红文字=35 \e[1;35m 洋红文字=35 \e[0m"  "    ########    "  "洋红背景=45 \e[1;45m 洋红背景=45 \e[0m\n"
echo -e "青色文字=36 \e[1;36m 青色文字=36 \e[0m"  "    ########    "  "青色背景=46 \e[1;46m 青色背景=46 \e[0m\n"
echo -e "白色文字=37 \e[1;37m 白色文字=37 \e[0m"  "    ########    "  "白色背景=47 \e[1;47m 白色背景=47 \e[0m\n"
echo -e "========================================================================================="

